#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_service_discovery_http_namespace.namespace: Refreshing state... [id=ns-ufwgav2zprjdgapp]
data.aws_caller_identity.current: Reading...
aws_kms_key.app_4_key: Refreshing state... [id=f03500bc-53b7-408d-82ff-e8957f6c8be7]
aws_vpc.this: Refreshing state... [id=vpc-05f8d6ed6a6eaebc5]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
aws_kms_alias.key: Refreshing state... [id=alias/app-4]
aws_kms_key_policy.encrypt_app: Refreshing state... [id=f03500bc-53b7-408d-82ff-e8957f6c8be7]
aws_cloudwatch_log_group.logs: Refreshing state... [id=/amazon-ecs/app-4/log]
aws_ecr_repository.image_repo: Refreshing state... [id=app-4]
aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:us-east-2:743794601996:cluster/app-4]
aws_internet_gateway.this_igw: Refreshing state... [id=igw-0460f3193e3d16070]
aws_route_table.this_rt: Refreshing state... [id=rtb-04e7b1d848677dbee]
aws_security_group.web_pub_sg: Refreshing state... [id=sg-0d35806c71918bc42]
aws_subnet.public[1]: Refreshing state... [id=subnet-04866c362ace04de9]
aws_subnet.public[2]: Refreshing state... [id=subnet-0f98c21a445c7d889]
aws_subnet.public[0]: Refreshing state... [id=subnet-02f618a72cefee6db]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-4/7a09bfa6254bf95d]
aws_route.internet_route: Refreshing state... [id=r-rtb-04e7b1d848677dbee1080289494]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0f390c135264155c4]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-073cb2ba1a8e70180]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-068f6659a2a72b4d7]
aws_lb.app_lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:loadbalancer/app/app-4/f6b8ef0fa489eee9]
aws_alb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:listener/app/app-4/f6b8ef0fa489eee9/7777390800677b05]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecr_repository.image_repo must be replaced
-/+ resource "aws_ecr_repository" "image_repo" {
      ~ arn                  = "arn:aws:ecr:us-east-2:743794601996:repository/app-4" -> (known after apply)
      ~ id                   = "app-4" -> (known after apply)
        name                 = "app-4"
      ~ registry_id          = "743794601996" -> (known after apply)
      ~ repository_url       = "743794601996.dkr.ecr.us-east-2.amazonaws.com/app-4" -> (known after apply)
      - tags                 = {} -> null
        # (2 unchanged attributes hidden)

      ~ encryption_configuration {
          ~ encryption_type = "AES256" -> "KMS" # forces replacement
          + kms_key         = "arn:aws:kms:us-east-2:743794601996:key/f03500bc-53b7-408d-82ff-e8957f6c8be7" # forces replacement
        }

        # (1 unchanged block hidden)
    }

  # aws_lb.app_lb will be updated in-place
  ~ resource "aws_lb" "app_lb" {
      ~ enable_deletion_protection                                   = false -> true
        id                                                           = "arn:aws:elasticloadbalancing:us-east-2:743794601996:loadbalancer/app/app-4/f6b8ef0fa489eee9"
        name                                                         = "app-4"
      ~ security_groups                                              = [
          - "sg-0d35806c71918bc42",
        ] -> (known after apply)
      ~ subnets                                                      = [
          - "subnet-0f98c21a445c7d889",
            # (2 unchanged elements hidden)
        ]
        tags                                                         = {}
        # (22 unchanged attributes hidden)

      - subnet_mapping {
          - subnet_id            = "subnet-02f618a72cefee6db" -> null
            # (4 unchanged attributes hidden)
        }
      - subnet_mapping {
          - subnet_id            = "subnet-04866c362ace04de9" -> null
            # (4 unchanged attributes hidden)
        }
      - subnet_mapping {
          - subnet_id            = "subnet-0f98c21a445c7d889" -> null
            # (4 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_route_table_association.public[2] will be destroyed
  # (because index [2] is out of range for count)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-0f390c135264155c4" -> null
      - route_table_id = "rtb-04e7b1d848677dbee" -> null
      - subnet_id      = "subnet-0f98c21a445c7d889" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_security_group.web_pub_sg must be replaced
-/+ resource "aws_security_group" "web_pub_sg" {
      ~ arn                    = "arn:aws:ec2:us-east-2:743794601996:security-group/sg-0d35806c71918bc42" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "traffic from the container"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      ~ id                     = "sg-0d35806c71918bc42" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "from vpc"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "traffic from the internet"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
      ~ name                   = "allow_inbound_access" -> "app-4_allow_inbound_access" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "743794601996" -> (known after apply)
        tags                   = {
            "Name" = "app-4-ec2-sg"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_subnet.public[2] will be destroyed
  # (because index [2] is out of range for count)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-2:743794601996:subnet/subnet-0f98c21a445c7d889" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-2c" -> null
      - availability_zone_id                           = "use2-az3" -> null
      - cidr_block                                     = "11.90.30.64/27" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0f98c21a445c7d889" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "743794601996" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "app-4-public-3"
        } -> null
      - tags_all                                       = {
          - "Name"   = "app-4-public-3"
          - "Source" = "https://github.com/kunduso/add-aws-ecr-ecs-fargate"
        } -> null
      - vpc_id                                         = "vpc-05f8d6ed6a6eaebc5" -> null
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*